[
        {
                "title": "Juego Del Dado",
                "subTitle": "Juego interactivo",
                "img":"dado",
                "description": "Al utilizar tecnologías esenciales como HTML, CSS y JavaScript, he diseñado una interfaz sencilla pero efectiva que permite a los usuarios seleccionar un número, generar un dado y esperar ansiosamente el resultado mientras los dados se animan en la pantalla. Además, he integrado un contador de intentos que añade emoción y desafío al juego. Este proyecto no solo demuestra mi capacidad para crear experiencias de usuario funcionales y atractivas, sino también mi habilidad para trabajar con lógica de programación de azar y gestionar eficazmente los eventos en una aplicación web. Estoy entusiasmado por la oportunidad de aplicar estas habilidades y seguir aprendiendo en un entorno profesional de desarrollo web.",
                "link": "https://github.com/FedeSca001/Juego-Del-Dado",
                "deploy": "https://juego-del-dado.netlify.app/"
        },
        {
                "title": "Scraping Bot",
                "subTitle": "Mi primer API",
                "img":"scraping-bot-img",
                "description": "Este servidor web desarrollado con Express y Node.js utiliza Cheerio para extraer cotizaciones del dólar en Argentina, el euro-dólar y los precios del oro desde múltiples sitios web. La función updateData actualiza estos datos automáticamente al iniciar el servidor y en cada solicitud a la ruta principal, devolviendo la información en formato JSON. Esta herramienta proporciona una forma eficiente de obtener información financiera actualizada en tiempo real, con una estructura modular y capacidad para manejar múltiples solicitudes simultáneamente, asegurando precisión y relevancia en los datos ofrecidos.",
                "link": "https://github.com/FedeSca001/bot-scraping",
                "deploy": "https://bot-scraping.onrender.com"
        },
        {
                "title": "Food-App",
                "subTitle": "E-commerce Vue 3",
                "img":"food-app-img",
                "description": "El proyecto utiliza Vue 3 con Vite como herramienta de construcción, Pinia como estado de gestión, Vuetify como biblioteca de componentes de interfaz de usuario y Axios para realizar llamadas a una API. La aplicación está diseñada para mostrar información relacionada con alimentos y permite interactuar con la API para obtener y mostrar datos actualizados..",
                "link": "https://github.com/FedeSca001/foods-app",
                "deploy": "https://foods-app-vue3.web.app/"
        },
        {
                "title": "ToDo App",
                "subTitle": "Mi primer servidor",
                "img":"to-do-app",
                "description": "El proyecto se centra en el funcionamiento y la comunicación entre el frontend y el backend. Es un servidor creado y alojado por el usuario, y utiliza Node.js con Express y Nodemon en el backend para manejar las solicitudes y respuestas. En el frontend, se utiliza Vue.js junto con Pinia y Axios para crear una lista de tareas. La aplicación permite al usuario agregar y eliminar tareas, y la comunicación entre el frontend y el backend se realiza mediante solicitudes HTTP.",
                "link": "https://github.com/FedeSca001/ToDo-list-Mevn-stack",
                "deploy": "https://to-do-list-full-stack.netlify.app"
        },
        {
                "title": "Parking Sites",
                "subTitle": "Conecto el back-end con el front-end.",
                "img":"parking-app-img",
                "description": "En éste proyecto lo verdaderamente importante es prestar atención al funcionamiento y la comunicación entre el front y el back. Es mi primer servidor creado y hosteado.",
                "link": "https://github.com/FedeSca001/parking-MEVN-front",
                "deploy": "https://parking-sites.netlify.app/"
        },
        {
                "title": "Fantasia Js",
                "subTitle": "E-commerce vanilla Js",
                "img":"fantasi-kiosco",
                "description": "Es un proyecto de un kiosco ficticio donde un cliente ingresa sus datos y encarga mercadería del kiosco. Utiliza jquery y ajax.",
                "link": "https://github.com/FedeSca001/Proyecto-final-Coder",
                "deploy": "https://kiosco-fantacia.netlify.app"
        }
]